Revit 2024 API
Frame Constructor
Overload List
Name | Description
Frame()
 Default constructor. Uses global origin and standard basis vectors.
Frame(XYZ, XYZ, XYZ, XYZ)
 Constructor that takes the frame's base point and three basis vectors.
See Also
Frame Class
Frame Members
Autodesk.Revit.DB Namespace